app/graphql/mutations/create_todo.rb

    def resolve(params:)
      #validate_input!
      todo = Todo.create!(params.to_h)
---
INSERT INTO "todos" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "dasds"], ["created_at", "2023-02-24 08:10:32.266539"], ["updated_at", "2023-02-24 08:10:32.266539"]]