app/graphql/mutations/delete_todo.rb

    def resolve(id:)
      Todo.find(id).delete
---
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 2]]
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]