app/graphql/mutations/update_todo.rb

    def resolve(id:, params:)
      todo = Todo.find(id)
      todo.update!(params.to_h)
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "めも 1f"], ["updated_at", "2023-02-24 08:12:35.000864"], ["id", 1]]