app/graphql/queries/todo_count.rb

      def resolve()
        ::Todo.count
---
SELECT COUNT(*) FROM "todos"